[
    {
        "title": "Portfolio WebSite",
        "description": "A personal portfolio website showcasing my projects and skills, built with modern web technologies like TypeScript and Next.js, and deployed on Vercel. This site serves as a central hub for my professional work, including detailed project showcases, code samples, and an overview of my technical expertise.",
        "type": "Personal Project",
        "imageUrl": "/assets/img/portfolio.png",
        "githubUrl": "",
        "demoUrl": "",
        "skills": ["TypeScript", "NextJS", "css", "Vercel"]
    },
    {
        "title": "SQL_Injection",
        "description": "A comprehensive site on SQL Injection vulnerabilities, their impact on web applications, and strategies for prevention, including practical implementation in a secure web application.",
        "type": "College Project",
        "imageUrl": "/assets/img/sql.png",
        "githubUrl": "https://github.com/hirpadii07?tab=repositories",
        "demoUrl": "",
        "skills": ["html", "python", "css", "MySql"]
    },
    {
        "title": "Social Media Application",
        "description": "This project builds a fullstack MERN social media app with secure user authentication, post management, and responsive design. The frontend uses React with Redux for state management and includes features like dark mode, profile management, and post interactions.",
        "type": "Personal Project",
        "imageUrl": "/assets/img/1.png",
        "githubUrl": "https://github.com/hirpadii07?tab=repositories",
        "demoUrl": "https://mern-social-media-aditya-pi.vercel.app/",
        "skills": ["html", "NodeJS", "css", "MongoDB", "React", "JSON"]
    },
    {
        "title": "Food Manager Application",
        "description": "This project involves developing a Food Waste Reduction Platform with distinct functionalities for retailers, charitable organizations, and consumers. It includes front-end interfaces, back-end logic, database management, and system integration to handle inventory management, food claims, and discount features.",
        "type": "College Project",
        "imageUrl": "/assets/img/2.png",
        "githubUrl": "https://github.com/hirpadii07?tab=repositories",
        "demoUrl": "",
        "skills": ["html", "Java", "css", "MySql"]
    },
    {
        "title": "Fitness Application",
        "description": "A fully responsive fitness web application designed using TypeScript, Vite, and CSS. It highlights gym services, fitness classes, and membership options, with modern UI elements and smooth user interactions for an enhanced user experience across all devices.",
        "type": "Personal Project",
        "imageUrl": "/assets/img/3.png",
        "githubUrl": "https://github.com/hirpadii07?tab=repositories",
        "demoUrl": "https://gym-typescript-master-bte.pages.dev/",
        "skills": ["TypeScript", "css", "Vite", "Tailwind", "React"]
    }
]
